ГТС/УТГТС/InformationRegisters/КрупнейшийНалогоплательщикИсторияРегистрацийВНалоговомОргане.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>КрупнейшийНалогоплательщикИсторияРегистрацийВНалоговомОргане</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>РегистрацияВНалоговомОргане</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РегистрацииВНалоговомОргане</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>СтруктурнаяЕдиница</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

ГТС/УТГТС/Catalogs/РегистрацииВНалоговомОргане.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>РегистрацииВНалоговомОргане</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Организации</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Доверенность</Name>
					<Comment>Доверенность налогоплательщика на представителя</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.МашиночитаемыеДоверенности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументПредставителя</Name>
					<Comment>Название документа, подтверждающего полномочия представителя</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодПоОКТМО</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>11</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодПоОКАТО</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>11</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦифровойИндексОбособленногоПодразделения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КПП</Name>
					<Comment>Код причины постановки</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>9</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеИФНС</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>254</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеОбособленногоПодразделения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>254</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Представитель</Name>
					<Comment>Представитель в территориальном органе ФНС</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УполномоченноеЛицоПредставителя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодРегиона</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеСлужебное</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>254</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПостановкиНаУчет</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСнятияСУчета</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Филиал</Name>
					<Comment>Филиал / ГО</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КрупнейшийНалогоплательщик</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>КонтактнаяИнформация</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Тип</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ТипыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вид</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>500</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначенияПолей</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Страна</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Регион</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Город</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АдресЭП</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоменноеИмяСервера</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефона</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефонаБезКодов</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидДляСписка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Подписанты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Пользователь</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Доверенность</Name>
							<Comment>Доверенность налогоплательщика на представителя</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.МашиночитаемыеДоверенности</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представитель</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УполномоченноеЛицоПредставителя</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДокументПредставителя</Name>
							<Comment>Название документа, подтверждающего полномочия представителя</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>1000</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

ГТС/УТГТС/InformationRegisters/КрупнейшийНалогоплательщикИсторияРегистрацийВНалоговомОргане/Forms/РедактированиеИстории/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;
	
	Параметры.Свойство("ВедущийОбъект", ВедущийОбъект);
	Если Не ЗначениеЗаполнено(ВедущийОбъект) Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	Параметры.Свойство("ВладелецРегистрацииВНалоговомОргане", ВладелецРегистрацииВНалоговомОргане);
	Если Не ЗначениеЗаполнено(ВладелецРегистрацииВНалоговомОргане) Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	ДатаОтсчетаПериодическихСведений = РегистрыСведений.КрупнейшийНалогоплательщикИсторияРегистрацийВНалоговомОргане.ДатаОтсчетаПериодическихСведений();
	
	Если Параметры.Свойство("ТолькоПросмотр") Тогда
		ТолькоПросмотр = Параметры.ТолькоПросмотр;
	КонецЕсли;
	
	Если НЕ ПравоДоступа("Редактирование", Метаданные.РегистрыСведений.КрупнейшийНалогоплательщикИсторияРегистрацийВНалоговомОргане) Тогда
		
		ТолькоПросмотр = Истина;
		
	КонецЕсли; 
	
	Если ТолькоПросмотр Тогда
		
		Элементы.ФормаКомандаОтмена.КнопкаПоУмолчанию = Истина;
		
	КонецЕсли;
	
	ТаблицаЗаписей = Параметры.НаборЗаписей.Выгрузить();
	Для Каждого Запись Из ТаблицаЗаписей Цикл
		ЗаполнитьЗначенияСвойств(НаборЗаписей.Добавить(), Запись);
		УстановитьСобытиеСнятияСУчета(НаборЗаписей);
	КонецЦикла;
	
	Если НаборЗаписей.Количество() > 0 Тогда
		Элементы.НаборЗаписей.ТекущаяСтрока = НаборЗаписей[НаборЗаписей.Количество()-1].ПолучитьИдентификатор();
	КонецЕсли;
	
КонецПроцедуры

#Область ОбработчикиСобытийТаблицыФормыНаборЗаписей

&НаКлиенте
Процедура НаборЗаписейПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если НоваяСтрока Тогда
	
		Если Элемент.ТекущиеДанные <> Неопределено Тогда
			
			Элемент.ТекущиеДанные.СтруктурнаяЕдиница = ВедущийОбъект;
			Элемент.ТекущиеДанные.РегистрацияВНалоговомОргане = ПредопределенноеЗначение("Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка");
			
			НовыйПериод = НачалоДня(ОбщегоНазначенияКлиент.ДатаСеанса());
			
			Если НаборЗаписей.Количество() > 1 Тогда
				ПоследнийПериод = НаборЗаписей.Получить(1).Период;
			Иначе
				ПоследнийПериод = '00010101000000';
			КонецЕсли;
			
			Если НовыйПериод <= ПоследнийПериод Тогда
				НовыйПериод = НачалоДня(ПоследнийПериод + 60*60*24);
			КонецЕсли;
			
			Элемент.ТекущиеДанные.Период = НовыйПериод;
			
			ЭтотОбъект.ТекущийЭлемент = Элементы.НаборЗаписейРегистрацияВНалоговомОргане;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НаборЗаписейПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	Если ОтменаРедактирования Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьСобытиеСнятияСУчета(НаборЗаписей);
	
КонецПроцедуры

&НаКлиенте
Процедура НаборЗаписейПередУдалением(Элемент, Отказ)
	
	Если Элемент.ТекущиеДанные.СнятоСУчета Тогда
		Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НаборЗаписейПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	УдалитьСобытиеСнятияСУчета(НаборЗаписей);
КонецПроцедуры

&НаКлиенте
Процедура НаборЗаписейПослеУдаления(Элемент)
	УстановитьСобытиеСнятияСУчета(НаборЗаписей);
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура КомандаОК(Команда)
	
	Отказ = Ложь;
	
	ПроверитьЗаполнениеИстории(Отказ);
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	УдалитьСобытиеСнятияСУчета(НаборЗаписей);
	
	ПараметрОповещения = Новый Структура;
	ПараметрОповещения.Вставить("ВедущийОбъект", ВедущийОбъект);
	ПараметрОповещения.Вставить("КрупнейшийНалогоплательщик", Истина);
	ПараметрОповещения.Вставить("ИмяРегистра", "КрупнейшийНалогоплательщикИсторияРегистрацийВНалоговомОргане");
	ПараметрОповещения.Вставить("ИсторияРегистрацииВНалоговомОргане", НаборЗаписей);
	
	Оповестить("КрупнейшийНалогоплательщикОтредактированаИстория", ПараметрОповещения, ВедущийОбъект);
	Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаОтмена(Команда)
	
	Закрыть();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Добавляет в историю (в конец) служебную строку "Снято с учета" в том случае,
// если в актуальной (последней) регистрации указана дата снятия с учета 
//
&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьСобытиеСнятияСУчета(ТаблицаИстории)
	
	// Таблица уже отсортирована - см. УстановитьПризнакПервоначальногоЗначения().
	// Последняя строка должна быть актуальным значением, либо снятием с учета.
	
	КоличествоЗаписей = ТаблицаИстории.Количество();
	Если КоличествоЗаписей > 0 Тогда
		
		ПоследняяСтрока = ТаблицаИстории[КоличествоЗаписей-1];
		
		Если ПоследняяСтрока.СнятоСУчета Тогда
			
			// Событие снятия с учета уже есть, но после редактирование может потребоваться его удалить, либо редактировать.
			
			Если КоличествоЗаписей > 1 Тогда
				
				// Как минимум одна значимая запись в истории есть (кроме служебной строки "Снято с учета").
				// Обновим событие снятия с учета из предпоследней строки. 
				ПредпоследняяСтрока = ТаблицаИстории[КоличествоЗаписей-2];
				ДатаСнятияСУчета = ДатаСнятияСУчетаРегистрации(ПредпоследняяСтрока.РегистрацияВНалоговомОргане);
				Если ЗначениеЗаполнено(ДатаСнятияСУчета) Тогда
					// Обновим дату события снятия с учета.
					ПоследняяСтрока.Период = ДатаСнятияСУчета;
				Иначе
					// После редактирования истории в актуальном налоговом органе организация не снята с учета.
					// Нужно удалить служебную запись.
					УдалитьСобытиеСнятияСУчета(ТаблицаИстории);
				КонецЕсли;
				
			Иначе
				// В истории 1 запись, и это служебная запись СнятоСУчета.
				// Так не должно быть - удалим.
				УдалитьСобытиеСнятияСУчета(ТаблицаИстории);
			КонецЕсли;	
			
		Иначе
			
			// В истории нет события снятия с учета.
			// Добавим его, если в актуальном налоговом органе организация снята с учета.
			ДатаСнятияСУчета = ДатаСнятияСУчетаРегистрации(ПоследняяСтрока.РегистрацияВНалоговомОргане);
			Если ЗначениеЗаполнено(ДатаСнятияСУчета) Тогда
				НоваяСтрока = ТаблицаИстории.Добавить();
				НоваяСтрока.СнятоСУчета = Истина;
				НоваяСтрока.Период = ДатаСнятияСУчета;
			КонецЕсли;	
						
		КонецЕсли;	
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УдалитьСобытиеСнятияСУчета(ТаблицаИстории)
	
	СтрокиСнятияСУчета = ТаблицаИстории.НайтиСтроки(Новый Структура("СнятоСУчета", Истина));
	
	Если СтрокиСнятияСУчета.Количество() > 0 Тогда
		ТаблицаИстории.Удалить(СтрокиСнятияСУчета[0]);
	КонецЕсли; 
		
КонецПроцедуры

// Дата снятия с учета регистрации.
// 
// Параметры:
//  РегистрацияВНалоговомОргане - СправочникСсылка.РегистрацииВНалоговомОргане - Регистрация в налоговом органе
// 
// Возвращаемое значение:
//  Дата
&НаСервереБезКонтекста
Функция ДатаСнятияСУчетаРегистрации(РегистрацияВНалоговомОргане)
	
	ДатаСнятияСУчета = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(РегистрацияВНалоговомОргане, "ДатаСнятияСУчета");
	
	Возврат ДатаСнятияСУчета;
	
КонецФункции	

&НаКлиенте
Процедура ПроверитьЗаполнениеИстории(Отказ)
	
	ПериодыСтрок = Новый Массив;
	
	Для Каждого Запись Из НаборЗаписей Цикл
		
		Если Запись.СнятоСУчета Тогда
			Продолжить;
		КонецЕсли;
		
		ИндексСтроки = НаборЗаписей.Индекс(Запись);
		ПрефиксСообщенияСтроки = "НаборЗаписей["+Формат(ИндексСтроки, "ЧЦ=; ЧДЦ=; ЧГ=")+"].";
		
		Если НЕ ЗначениеЗаполнено(Запись.Период) И ИндексСтроки > 0 Тогда
			СообщениеОбОшибке = НСтр("ru = 'Нужно указать дату начала действия'");
			ОбщегоНазначенияКлиент.СообщитьПользователю(СообщениеОбОшибке, , ПрефиксСообщенияСтроки+"Период", , Отказ);
		КонецЕсли;
		
		Если ПериодыСтрок.Найти(Запись.Период) = Неопределено Тогда
			Если ЗначениеЗаполнено(Запись.Период) Тогда
				ПериодыСтрок.Добавить(Запись.Период);
			КонецЕсли;
		Иначе
			// Строка с такой датой уже была раньше, это ошибка.
			// Не может быть 2 строки с одинаковой датой.
			СообщениеОбОшибке = НСтр("ru = 'Уже есть запись с указанной датой сведений'");
			ОбщегоНазначенияКлиент.СообщитьПользователю(СообщениеОбОшибке, , ПрефиксСообщенияСтроки+"Период", , Отказ);
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(Запись.РегистрацияВНалоговомОргане) Тогда
			СообщениеОбОшибке = НСтр("ru = 'Поле ""Регистрация в налоговом органе"" не заполнено'");
			ОбщегоНазначенияКлиент.СообщитьПользователю(СообщениеОбОшибке, , ПрефиксСообщенияСтроки+"РегистрацияВНалоговомОргане", , Отказ);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти
